---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ElectricalSystem..::..Create Method
ElectricalSystem Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | Create(Connector, ElectricalSystemType) | Creates a new MEP Electrical System element from an unused Connector. |
|  | Create(Document, IList<(Of <<'(ElementId>)>>), ElectricalSystemType) | Creates a new MEP Electrical System element from a set of electrical components. |

# See Also

ElectricalSystem Class

ElectricalSystem Members

Autodesk.Revit.DB.Electrical Namespace